EasyPost.Tests/cassettes/net/shipment/refund_with_no_id.json

[
  {
    "Duration": 303,
    "RecordedAt": "2022-11-08T11:56:32.443283-07:00",
    "Request": {
      "Body": "{\"shipment\":{\"to_address\":{\"name\":\"Jack Sparrow\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"email\":\"<REDACTED>\",\"phone\":\"<REDACTED>\"},\"from_address\":{\"name\":\"Elizabeth Swan\",\"street1\":\"179 N Harbor Dr\",\"city\":\"Redondo Beach\",\"state\":\"CA\",\"zip\":\"90277\",\"country\":\"US\",\"email\":\"<REDACTED>\",\"phone\":\"<REDACTED>\"},\"parcel\":{\"length\":10,\"width\":8,\"height\":4,\"weight\":15.4},\"service\":\"First\",\"carrier_accounts\":[\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"],\"carrier\":\"USPS\"},\"carbon_offset\":false}",
      "BodyContentType": "Json",
      "ContentHeaders": {
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "567"
      },
      "Method": "POST",
      "RequestHeaders": {
        "Authorization": "<REDACTED>",
        "content_type": "application/json",
        "Accept": "application/json,text/json,text/x-json,text/javascript,application/xml,text/xml",
        "User-Agent": "<REDACTED>"
      },
      "Uri": "https://api.easypost.com/v2/shipments"
    },
    "Response": {
      "Body": "{\"created_at\":\"2022-11-08T18:56:31Z\",\"is_return\":false,\"messages\":[],\"mode\":\"test\",\"options\":{\"currency\":\"USD\",\"payment\":{\"type\":\"SENDER\"},\"date_advance\":0},\"reference\":null,\"status\":\"unknown\",\"tracking_code\":\"9400100106068148377315\",\"updated_at\":\"2022-11-08T18:56:32Z\",\"batch_id\":null,\"batch_status\":null,\"batch_message\":null,\"customs_info\":null,\"from_address\":{\"id\":\"adr_0ef3786f5f9711ed8433ac1f6bc72124\",\"object\":\"Address\",\"created_at\":\"2022-11-08T11:56:31-07:00\",\"updated_at\":\"2022-11-08T11:56:31-07:00\",\"name\":\"Elizabeth Swan\",\"company\":null,\"street1\":\"179 N Harbor Dr\",\"street2\":null,\"city\":\"Redondo Beach\",\"state\":\"CA\",\"zip\":\"90277\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"insurance\":null,\"order_id\":null,\"parcel\":{\"id\":\"prcl_82d218ed8ab746c1ad65aa8b5eb97d98\",\"object\":\"Parcel\",\"created_at\":\"2022-11-08T18:56:31Z\",\"updated_at\":\"2022-11-08T18:56:31Z\",\"length\":10.0,\"width\":8.0,\"height\":4.0,\"predefined_package\":null,\"weight\":15.4,\"mode\":\"test\"},\"postage_label\":{\"object\":\"PostageLabel\",\"id\":\"pl_044b1d16912b4751900cad7879d66c16\",\"created_at\":\"2022-11-08T18:56:31Z\",\"updated_at\":\"2022-11-08T18:56:32Z\",\"date_advance\":0,\"integrated_form\":\"none\",\"label_date\":\"2022-11-08T18:56:31Z\",\"label_resolution\":300,\"label_size\":\"4x6\",\"label_type\":\"default\",\"label_file_type\":\"image/png\",\"label_url\":\"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20221108/5e6ce2174aab492494ef3a0de795b171.png\",\"label_pdf_url\":null,\"label_zpl_url\":null,\"label_epl2_url\":null,\"label_file\":null},\"rates\":[{\"id\":\"rate_071d13859caf4435b46b59cdd92ccf53\",\"object\":\"Rate\",\"created_at\":\"2022-11-08T18:56:31Z\",\"updated_at\":\"2022-11-08T18:56:31Z\",\"mode\":\"test\",\"service\":\"ParcelSelect\",\"carrier\":\"USPS\",\"rate\":\"8.00\",\"currency\":\"USD\",\"retail_rate\":\"8.00\",\"retail_currency\":\"USD\",\"list_rate\":\"8.00\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":5,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":5,\"shipment_id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_acb61393dafc4fcb9309097c77b896e3\",\"object\":\"Rate\",\"created_at\":\"2022-11-08T18:56:31Z\",\"updated_at\":\"2022-11-08T18:56:31Z\",\"mode\":\"test\",\"service\":\"Express\",\"carrier\":\"USPS\",\"rate\":\"29.75\",\"currency\":\"USD\",\"retail_rate\":\"33.85\",\"retail_currency\":\"USD\",\"list_rate\":\"29.75\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":null,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":null,\"shipment_id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_c3167a4187544492adf29adc37d82523\",\"object\":\"Rate\",\"created_at\":\"2022-11-08T18:56:31Z\",\"updated_at\":\"2022-11-08T18:56:31Z\",\"mode\":\"test\",\"service\":\"Priority\",\"carrier\":\"USPS\",\"rate\":\"8.15\",\"currency\":\"USD\",\"retail_rate\":\"9.75\",\"retail_currency\":\"USD\",\"list_rate\":\"8.15\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_251636fda62d42fea4b02b7f6a36c6dd\",\"object\":\"Rate\",\"created_at\":\"2022-11-08T18:56:31Z\",\"updated_at\":\"2022-11-08T18:56:31Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.82\",\"currency\":\"USD\",\"retail_rate\":\"5.82\",\"retail_currency\":\"USD\",\"list_rate\":\"5.82\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"}],\"refund_status\":null,\"scan_form\":null,\"selected_rate\":{\"id\":\"rate_251636fda62d42fea4b02b7f6a36c6dd\",\"object\":\"Rate\",\"created_at\":\"2022-11-08T18:56:32Z\",\"updated_at\":\"2022-11-08T18:56:32Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.82\",\"currency\":\"USD\",\"retail_rate\":\"5.82\",\"retail_currency\":\"USD\",\"list_rate\":\"5.82\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},\"tracker\":{\"id\":\"trk_b1bd29e689b64498808bc2c5de2e9ae3\",\"object\":\"Tracker\",\"mode\":\"test\",\"tracking_code\":\"9400100106068148377315\",\"status\":\"unknown\",\"status_detail\":\"unknown\",\"created_at\":\"2022-11-08T18:56:32Z\",\"updated_at\":\"2022-11-08T18:56:32Z\",\"signed_by\":null,\"weight\":null,\"est_delivery_date\":null,\"shipment_id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"carrier\":\"USPS\",\"tracking_details\":[],\"fees\":[],\"carrier_detail\":null,\"public_url\":\"https://track.easypost.com/djE6dHJrX2IxYmQyOWU2ODliNjQ0OTg4MDhiYzJjNWRlMmU5YWUz\"},\"to_address\":{\"id\":\"adr_0ef0cd2b5f9711edafc8ac1f6bc7bdc6\",\"object\":\"Address\",\"created_at\":\"2022-11-08T11:56:31-07:00\",\"updated_at\":\"2022-11-08T11:56:31-07:00\",\"name\":\"JACK SPARROW\",\"company\":null,\"street1\":\"388 TOWNSEND ST APT 20\",\"street2\":null,\"city\":\"SAN FRANCISCO\",\"state\":\"CA\",\"zip\":\"94107-1670\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":true,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":37.77551,\"longitude\":-122.39697,\"time_zone\":\"America/Los_Angeles\"}}}},\"usps_zone\":4,\"return_address\":{\"id\":\"adr_0ef3786f5f9711ed8433ac1f6bc72124\",\"object\":\"Address\",\"created_at\":\"2022-11-08T11:56:31-07:00\",\"updated_at\":\"2022-11-08T11:56:31-07:00\",\"name\":\"Elizabeth Swan\",\"company\":null,\"street1\":\"179 N Harbor Dr\",\"street2\":null,\"city\":\"Redondo Beach\",\"state\":\"CA\",\"zip\":\"90277\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"buyer_address\":{\"id\":\"adr_0ef0cd2b5f9711edafc8ac1f6bc7bdc6\",\"object\":\"Address\",\"created_at\":\"2022-11-08T11:56:31-07:00\",\"updated_at\":\"2022-11-08T11:56:31-07:00\",\"name\":\"JACK SPARROW\",\"company\":null,\"street1\":\"388 TOWNSEND ST APT 20\",\"street2\":null,\"city\":\"SAN FRANCISCO\",\"state\":\"CA\",\"zip\":\"94107-1670\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":true,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":37.77551,\"longitude\":-122.39697,\"time_zone\":\"America/Los_Angeles\"}}}},\"forms\":[],\"fees\":[{\"object\":\"Fee\",\"type\":\"LabelFee\",\"amount\":\"0.01000\",\"charged\":true,\"refunded\":false},{\"object\":\"Fee\",\"type\":\"PostageFee\",\"amount\":\"5.82000\",\"charged\":true,\"refunded\":false}],\"id\":\"shp_7f7fe2ab17104aaf985f446c6a3845f9\",\"object\":\"Shipment\"}",
      "BodyContentType": "Json",
      "ContentHeaders": {
        "Expires": "0",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "6984"
      },
      "HttpVersion": "1.1",
      "ResponseHeaders": {
        "X-Frame-Options": "SAMEORIGIN",
        "X-XSS-Protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "x-download-options": "noopen",
        "x-permitted-cross-domain-policies": "none",
        "Referrer-Policy": "strict-origin-when-cross-origin",
        "x-ep-request-uuid": "cd054f38636aa65fec9e84a200043961",
        "Cache-Control": "no-store, no-cache, private",
        "Pragma": "no-cache",
        "Location": "/api/v2/shipments/shp_7f7fe2ab17104aaf985f446c6a3845f9",
        "ETag": "W/\"a4f62bbd4c9b30eb47bb143870059ff1\"",
        "x-runtime": "1.125005",
        "x-node": "bigweb6nuq",
        "x-version-label": "easypost-202211080047-e0c2474e04-master",
        "x-backend": "easypost",
        "x-proxied": "intlb1nuq 29913d444b,extlb2nuq 29913d444b",
        "Strict-Transport-Security": "max-age=31536000; includeSubDomains; preload"
      },
      "Status": {
        "Code": 201,
        "Message": "Created"
      }
    }
  }
]
