EasyPost.Tests/cassettes/netstandard/shipment/refund_with_no_id.json

[
  {
    "Duration": 804,
    "RecordedAt": "2022-10-28T12:21:22.209264-06:00",
    "Request": {
      "Body": "{\"shipment\":{\"to_address\":{\"name\":\"Jack Sparrow\",\"street1\":\"388 Townsend St\",\"street2\":\"Apt 20\",\"city\":\"San Francisco\",\"state\":\"CA\",\"zip\":\"94107\",\"country\":\"US\",\"email\":\"<REDACTED>\",\"phone\":\"<REDACTED>\"},\"from_address\":{\"name\":\"Elizabeth Swan\",\"street1\":\"179 N Harbor Dr\",\"city\":\"Redondo Beach\",\"state\":\"CA\",\"zip\":\"90277\",\"country\":\"US\",\"email\":\"<REDACTED>\",\"phone\":\"<REDACTED>\"},\"parcel\":{\"length\":10,\"width\":8,\"height\":4,\"weight\":15.4},\"service\":\"First\",\"carrier_accounts\":[\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"],\"carrier\":\"USPS\"},\"carbon_offset\":false}",
      "BodyContentType": "Json",
      "ContentHeaders": {
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "567"
      },
      "Method": "POST",
      "RequestHeaders": {
        "Authorization": "<REDACTED>",
        "content_type": "application/json",
        "Accept": "application/json,text/json,text/x-json,text/javascript,application/xml,text/xml",
        "User-Agent": "<REDACTED>"
      },
      "Uri": "https://api.easypost.com/v2/shipments"
    },
    "Response": {
      "Body": "{\"created_at\":\"2022-10-28T18:21:21Z\",\"is_return\":false,\"messages\":[],\"mode\":\"test\",\"options\":{\"currency\":\"USD\",\"payment\":{\"type\":\"SENDER\"},\"date_advance\":0},\"reference\":null,\"status\":\"unknown\",\"tracking_code\":\"9400100106068146026451\",\"updated_at\":\"2022-10-28T18:21:22Z\",\"batch_id\":null,\"batch_status\":null,\"batch_message\":null,\"customs_info\":null,\"from_address\":{\"id\":\"adr_529efceb56ed11edb660ac1f6bc7b362\",\"object\":\"Address\",\"created_at\":\"2022-10-28T12:21:21-06:00\",\"updated_at\":\"2022-10-28T12:21:21-06:00\",\"name\":\"Elizabeth Swan\",\"company\":null,\"street1\":\"179 N Harbor Dr\",\"street2\":null,\"city\":\"Redondo Beach\",\"state\":\"CA\",\"zip\":\"90277\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"insurance\":null,\"order_id\":null,\"parcel\":{\"id\":\"prcl_1c816c23151d4ac0adf0253a5cd49b56\",\"object\":\"Parcel\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:21Z\",\"length\":10.0,\"width\":8.0,\"height\":4.0,\"predefined_package\":null,\"weight\":15.4,\"mode\":\"test\"},\"postage_label\":{\"object\":\"PostageLabel\",\"id\":\"pl_3074cbc914c643e3af4802b5ba86a2c4\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:22Z\",\"date_advance\":0,\"integrated_form\":\"none\",\"label_date\":\"2022-10-28T18:21:21Z\",\"label_resolution\":300,\"label_size\":\"4x6\",\"label_type\":\"default\",\"label_file_type\":\"image/png\",\"label_url\":\"https://easypost-files.s3.us-west-2.amazonaws.com/files/postage_label/20221028/9aa1e88f232d4aebb2337645f7a166d5.png\",\"label_pdf_url\":null,\"label_zpl_url\":null,\"label_epl2_url\":null,\"label_file\":null},\"rates\":[{\"id\":\"rate_1a33377f90ff42909b0952143c4f01da\",\"object\":\"Rate\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:21Z\",\"mode\":\"test\",\"service\":\"Priority\",\"carrier\":\"USPS\",\"rate\":\"8.15\",\"currency\":\"USD\",\"retail_rate\":\"9.75\",\"retail_currency\":\"USD\",\"list_rate\":\"8.15\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":2,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":2,\"shipment_id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_f2ca26212203428bb76d23596f2342a0\",\"object\":\"Rate\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:21Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.82\",\"currency\":\"USD\",\"retail_rate\":\"5.82\",\"retail_currency\":\"USD\",\"list_rate\":\"5.82\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_c649ee6883b54823b51e4cfa3ac2ebc2\",\"object\":\"Rate\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:21Z\",\"mode\":\"test\",\"service\":\"Express\",\"carrier\":\"USPS\",\"rate\":\"29.75\",\"currency\":\"USD\",\"retail_rate\":\"33.85\",\"retail_currency\":\"USD\",\"list_rate\":\"29.75\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":null,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":null,\"shipment_id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},{\"id\":\"rate_a729ac10c3934a889d806bb51e77e756\",\"object\":\"Rate\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:21Z\",\"mode\":\"test\",\"service\":\"ParcelSelect\",\"carrier\":\"USPS\",\"rate\":\"8.00\",\"currency\":\"USD\",\"retail_rate\":\"8.00\",\"retail_currency\":\"USD\",\"list_rate\":\"8.00\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":5,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":5,\"shipment_id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"}],\"refund_status\":null,\"scan_form\":null,\"selected_rate\":{\"id\":\"rate_f2ca26212203428bb76d23596f2342a0\",\"object\":\"Rate\",\"created_at\":\"2022-10-28T18:21:21Z\",\"updated_at\":\"2022-10-28T18:21:21Z\",\"mode\":\"test\",\"service\":\"First\",\"carrier\":\"USPS\",\"rate\":\"5.82\",\"currency\":\"USD\",\"retail_rate\":\"5.82\",\"retail_currency\":\"USD\",\"list_rate\":\"5.82\",\"list_currency\":\"USD\",\"billing_type\":\"easypost\",\"delivery_days\":3,\"delivery_date\":null,\"delivery_date_guaranteed\":false,\"est_delivery_days\":3,\"shipment_id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"carrier_account_id\":\"ca_7642d249fdcf47bcb5da9ea34c96dfcf\"},\"tracker\":{\"id\":\"trk_a27228b03f4243a59d802d669f35ceba\",\"object\":\"Tracker\",\"mode\":\"test\",\"tracking_code\":\"9400100106068146026451\",\"status\":\"unknown\",\"status_detail\":\"unknown\",\"created_at\":\"2022-10-28T18:21:22Z\",\"updated_at\":\"2022-10-28T18:21:22Z\",\"signed_by\":null,\"weight\":null,\"est_delivery_date\":null,\"shipment_id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"carrier\":\"USPS\",\"tracking_details\":[],\"fees\":[],\"carrier_detail\":null,\"public_url\":\"https://track.easypost.com/djE6dHJrX2EyNzIyOGIwM2Y0MjQzYTU5ZDgwMmQ2NjlmMzVjZWJh\"},\"to_address\":{\"id\":\"adr_529ca59356ed11ed868cac1f6bc72124\",\"object\":\"Address\",\"created_at\":\"2022-10-28T12:21:21-06:00\",\"updated_at\":\"2022-10-28T12:21:21-06:00\",\"name\":\"JACK SPARROW\",\"company\":null,\"street1\":\"388 TOWNSEND ST APT 20\",\"street2\":null,\"city\":\"SAN FRANCISCO\",\"state\":\"CA\",\"zip\":\"94107-1670\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":true,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":37.77551,\"longitude\":-122.39697,\"time_zone\":\"America/Los_Angeles\"}}}},\"usps_zone\":4,\"return_address\":{\"id\":\"adr_529efceb56ed11edb660ac1f6bc7b362\",\"object\":\"Address\",\"created_at\":\"2022-10-28T12:21:21-06:00\",\"updated_at\":\"2022-10-28T12:21:21-06:00\",\"name\":\"Elizabeth Swan\",\"company\":null,\"street1\":\"179 N Harbor Dr\",\"street2\":null,\"city\":\"Redondo Beach\",\"state\":\"CA\",\"zip\":\"90277\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":null,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{}},\"buyer_address\":{\"id\":\"adr_529ca59356ed11ed868cac1f6bc72124\",\"object\":\"Address\",\"created_at\":\"2022-10-28T12:21:21-06:00\",\"updated_at\":\"2022-10-28T12:21:21-06:00\",\"name\":\"JACK SPARROW\",\"company\":null,\"street1\":\"388 TOWNSEND ST APT 20\",\"street2\":null,\"city\":\"SAN FRANCISCO\",\"state\":\"CA\",\"zip\":\"94107-1670\",\"country\":\"US\",\"phone\":\"<REDACTED>\",\"email\":\"<REDACTED>\",\"mode\":\"test\",\"carrier_facility\":null,\"residential\":true,\"federal_tax_id\":null,\"state_tax_id\":null,\"verifications\":{\"zip4\":{\"success\":true,\"errors\":[],\"details\":null},\"delivery\":{\"success\":true,\"errors\":[],\"details\":{\"latitude\":37.77551,\"longitude\":-122.39697,\"time_zone\":\"America/Los_Angeles\"}}}},\"forms\":[],\"fees\":[{\"object\":\"Fee\",\"type\":\"LabelFee\",\"amount\":\"0.01000\",\"charged\":true,\"refunded\":false},{\"object\":\"Fee\",\"type\":\"PostageFee\",\"amount\":\"5.82000\",\"charged\":true,\"refunded\":false}],\"id\":\"shp_e4b896b54c4a42129193c9fb243bb0b4\",\"object\":\"Shipment\"}",
      "BodyContentType": "Json",
      "ContentHeaders": {
        "Expires": "0",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "6984"
      },
      "HttpVersion": "1.1",
      "ResponseHeaders": {
        "X-Frame-Options": "SAMEORIGIN",
        "x-xss-protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "x-download-options": "noopen",
        "x-permitted-cross-domain-policies": "none",
        "referrer-policy": "strict-origin-when-cross-origin",
        "x-ep-request-uuid": "3b57c215635c1da0eca35623001c556f",
        "Cache-Control": "no-store, no-cache, private",
        "Pragma": "no-cache",
        "Location": "/api/v2/shipments/shp_e4b896b54c4a42129193c9fb243bb0b4",
        "ETag": "W/\"f59331c2a189bde9d7322a2e9a43fbf1\"",
        "x-runtime": "1.126657",
        "x-node": "bigweb6nuq",
        "x-version-label": "easypost-202210272318-f4b1e6c89f-master",
        "x-backend": "easypost",
        "x-proxied": "intlb2nuq 29913d444b,intlb1wdc 29913d444b,extlb3wdc 29913d444b",
        "Strict-Transport-Security": "max-age=31536000; includeSubDomains; preload"
      },
      "Status": {
        "Code": 201,
        "Message": "Created"
      }
    }
  }
]
